Конфигурация отчетов/Documents/ПриходТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриходТовара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>InformationRegister.Цены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНакладной</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмирения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаНаПродажу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтараяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмирения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмирения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеНаЭтикетке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальнаПродажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УКТЗЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШтрихКоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипШтрихКода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыШтрихКодов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация отчетов/Documents/ПриходТовара/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция СтатусПроведения()

	Возврат Объект.Проведен;

КонецФункции // СтатусПроведения()

&НаКлиенте
Процедура РедактированиеФормы()
	
	Если СтатусПроведения() = Истина Тогда	
		Элементы.СтандартныеРеквезиты.Доступность = Ложь;
		Элементы.ДанныеПН.Доступность = Ложь;
		Элементы.ТЧ.Доступность = Ложь;
	Иначе	
		Элементы.СтандартныеРеквезиты.Доступность = Истина;
		Элементы.ДанныеПН.Доступность = Истина;
		Элементы.ТЧ.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры // РедактированиеФормы()


&НаСервере
Процедура ТЧПриИзмененииНаСервере()
	Товары = Объект.ТЧ;
	Объект.СуммаНакладной = 0;
	Для Каждого ТМЦ Из Товары Цикл
		ТМЦ.ЕдиницаИзмирения = ТМЦ.Номенклатура.ЕдиницаИзмирения;	
		Если ТМЦ.СтараяЦена = 0 Тогда
			ТМЦ.СтараяЦена = ПолучениеИнформации.ПолучитьЦену(ТМЦ.Номенклатура);
			ТМЦ.Остаток = ПолучениеИнформации.ПолучитьОстаток(ТМЦ.Номенклатура);
		КонецЕсли;
		Объект.СуммаНакладной = Объект.СуммаНакладной + ТМЦ.Сумма; 
	КонецЦикла;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧПриИзменении(Элемент)
	ТЧПриИзмененииНаСервере();
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Склад = Константы.СкладПоУмолчанию.Получить();
	Объект.Контрагент = Константы.КонтрагентПоУмолчанию.Получить();

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии()
	РедактированиеФормы();
КонецПроцедуры

&НаСервере
Процедура ИзменениеСуммыНаСервере()
	Товары = Объект.ТЧ;
	Для Каждого ТМЦ Из Товары Цикл
		ТМЦ.Сумма = ТМЦ.Количество * ТМЦ.Цена;	
	КонецЦикла;
	Записать();

КонецПроцедуры

&НаКлиенте
Процедура ТЧКоличествоПриИзменении(Элемент)
	ИзменениеСуммыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЧЦенаПриИзменении(Элемент)
	ИзменениеСуммыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТЧСуммаПриИзмененииНаСервере()
	Товары = Объект.ТЧ;
	Для Каждого ТМЦ Из Товары Цикл
		ТМЦ.Цена = ТМЦ.Сумма / ТМЦ.Количество;	
	КонецЦикла;
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ТЧСуммаПриИзменении(Элемент)
	ТЧСуммаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТЧШтрихКодПриИзмененииНаСервере()
	
	ТекСтрокаИд = Элементы.ТЧ.ТекущаяСтрока;
	
	ТекСтрокаТовары = Объект.ТЧ.НайтиПоИдентификатору(ТекСтрокаИд);
	НайденыйТовар = Справочники.Номенклатура.НайтиПоРеквизиту("ШтрихКод",ТекСтрокаТовары.ШтрихКод);
	ТекСтрокаТовары.Номенклатура = НайденыйТовар;

КонецПроцедуры

&НаКлиенте
Процедура ТЧШтрихКодПриИзменении(Элемент)
	ТЧШтрихКодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция  ПроверкаЗаполненияПолей()
	Если Объект.Контрагент.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ТМЦ Из Объект.ТЧ Цикл
		//Если ТМЦ.Количество = 0 Тогда
		//	Возврат Ложь;
		//ИначеЕсли ТМЦ.Цена = 0 Тогда
		//	Возврат Ложь;
		//ИначеЕсли ТМЦ.Сумма = 0 Тогда
		//	Возврат Ложь;
		//ИначеЕсли ТМЦ.ЦенаНаПродажу = 0 Тогда
		//	Возврат Ложь;	
		//КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ПроверкаЗаполненияПолей() = Ложь Тогда
		Сообщить("В документе присутствуют незаполненые поля!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	РедактированиеФормы();
КонецПроцедуры
